{
	"space": [
		{
			"name": "Lab",
			"id": "lab",
			"include": true,
			"mandatory": true,
			"url": "https://en.wikipedia.org/wiki/CIELAB_color_space",
			"description": "A CIE color space with fairly good perceptually uniformity. Lab has a central Lightness axis (black at 0, white at 100, mid-grey at 50) and two opponent color axes. The a axis has pinkish reds in the positive direction and the complementary bluish-greens in the negative direction. The b axis has yellows in the positive direction and the complementary blue-violets in the negative direction. The geometric distance between two points in Lab is a good first approximation to how different the two colors look. Commercial color-measuring instruments report values in Lab, and it is used as an intermediate space for gamut mapping and colorspace interconversion."
		},
		{
			"name": "LCH",
			"id": "lch",
			"include": true,
			"mandatory": true,
			"dependencies": ["lab"],
			"url": "https://en.wikipedia.org/wiki/CIELAB_color_space#Cylindrical_representation:_CIELCh_or_CIEHLC",
			"description": "LCH is the polar form of Lab. Instead of juggling a and b, you specify a Hue angle (starting from the positive a axis) and a Chroma, or colorfulness, which is zero for neutral greys and increases as a color becomes more intensely colorful."
		},
		{
			"name": "XYZ-D65",
			"id": "xyz-d65",
			"include": true,
			"mandatory": true,
			"url": "https://en.wikipedia.org/wiki/CIE_1931_color_space",
			"description": "The fundamental CIE color space, derived from color-matching experiments on human vision. All other color spaces can be converted to XYZ. Encodes linear light intensity. XYZ-D65 assumes the eye is adapted to the D65 daylight white point, which is true for most color spaces."
		},
		{
			"name": "XYZ-D50",
			"id": "xyz-d50",
			"url": "https://en.wikipedia.org/wiki/CIE_1931_color_space",
			"description": "XYZ-D50 assumes the eye is adapted to the graphic arts D50 daylight white point, which is the case for ProPhoto RGB. Measured CIE Lab values are also typically reported with a D50 white point. Color.js will also internally create XYZ color spaces with different white points as needed (for example, converting to and from the ACES color spaces)."
		},
		{
			"name": "sRGB",
			"id": "srgb",
			"include": true,
			"mandatory": true,
			"url": "https://en.wikipedia.org/wiki/SRGB",
			"description": "The color space of all CSS colors before CSS Color Level 4, sRGB is derived from the definition of HDTV. Most screens can display all, or very nearly all, sRGB colors but there are many visible colors which lie outside the sRGB gamut."
		},
		{
			"name": "Linear sRGB",
			"id": "srgb-linear",
			"include": true,
			"url": "https://en.wikipedia.org/wiki/SRGB",
			"description": "sRGB, but with a linear-light transfer function."
		},
		{
			"name": "Display P3",
			"id": "p3",
			"include": true,
			"dependencies": ["srgb"],
			"url": "https://en.wikipedia.org/wiki/DCI-P3#Display_P3",
			"description": "The color space of most commercial wide gamut screens today. 50% larger gamut (by volume) than sRGB. CSS Color level 4 allowed these colors to be used in stylesheets for the first time. It is derived from a digital cinema projector standard, DCI-P3 but the transfer curve, whitepoint and viewing conditions are the same as for sRGB."
		},
		{
			"name": "Linear Display P3",
			"id": "p3-linear",
			"include": true,
			"dependencies": ["srgb"],
			"url": "https://drafts.csswg.org/css-color-4/#predefined-display-p3-linear",
			"description": "Display P3, but with a linear-light transfer function."
		},
		{
			"name": "Adobe® RGB Compatible",
			"id": "a98rgb",
			"dependencies": ["srgb"],
			"url": "https://en.wikipedia.org/wiki/Adobe_RGB_color_space",
			"description": "Another wide gamut RGB color space, encompassed roughly 50% of visible colors, and popular in digital photography. The name `Adobe® (1998) RGB' is trademarked, but a colorspace which is 100% identical can be described as `compatible` as long as it uses a different name."
		},
		{
			"name": "REC.2020",
			"id": "rec2020",
			"dependencies": ["srgb"],
			"url": "https://en.wikipedia.org/wiki/Rec._2020",
			"description": "A very wide gamut RGB color space used in 4k and 8k UHDTV. It is currently difficult to make a screen which displays the entire REC.2020 gamut; current movies broadcast in this colorspace do not use the full gamut, although they do use a little more than P3."
		},
		{
			"name": "REC.2020 Scene Referred",
			"id": "--rec2020-oetf",
			"dependencies": ["srgb"],
			"url": "https://en.wikipedia.org/wiki/Rec._2020",
			"description": "Scene-referred version of REC.2020"
		},
		{
			"name": "REC.2100-PQ",
			"id": "rec2100pq",
			"dependencies": ["rec2020"],
			"url": "https://en.wikipedia.org/wiki/Rec._2100",
			"description": "One of the two HDR forms of Rec.2020; PQ stands for Perceptual Quantizer and is designed to avoid banding when HDR material is encoded with only 10 or 12 bits per component. REC.2100-PQ encodes absolute display luminance, in the range 0 to 10,000 cd/m2. Intended to be viewed in a dim viewing environment. Media white is typically displayed at around 200 cd/m2 (varying with content), values brighter than that are highlights."
		},
		{
			"name": "REC.2100-HLG",
			"id": "rec2100hlg",
			"dependencies": ["rec2020"],
			"url": "https://en.wikipedia.org/wiki/Rec._2100",
			"description": "One of the two HDR forms of Rec.2020; HLG stands for Hybrid Log-Gamma and is designed to maximise compatibility with SDR broadcast standards. REC.2100-HLG encodes relative scene luminance, so that it can be adapted to a wide range of viewing conditions and display peak luminances. Media white is encoded at a value of 0.75, values brighter than that are highlights."
		},
		{
			"name": "ProPhoto",
			"id": "prophoto",
			"dependencies": ["srgb"],
			"url": "https://en.wikipedia.org/wiki/ProPhoto_RGB_color_space",
			"description": "Very wide gamut RGB color space with primaries outside the range of human vision. Designed to avoid hue shifts when sigmoid (contrast-changing) functions are applied directly to the RGB channels, so it is popular as an authoring space for digital photography. Includes 90% of visible colors, but also encodes many values that are not physically realizable colors. Requires gamut mapping before display."
		},
		{
			"name": "HSL",
			"id": "hsl",
			"include": true,
			"dependencies": ["srgb"],
			"url": "https://en.wikipedia.org/wiki/HSL_and_HSV",
			"description": "Polar transformation of sRGB, supported as early as CSS Color Level 3. Beware the perceptually non-uniform hue, and don't compare the lightness of colors with different hue."
		},
		{
			"name": "HWB",
			"id": "hwb",
			"dependencies": ["hsl"],
			"url": "https://en.wikipedia.org/wiki/HWB_color_model",
			"description": "Another polar transformation of sRGB with hue, whiteness, and blackness coordinates."
		},
		{
			"name": "HSV",
			"id": "hsv",
			"dependencies": ["hsl"],
			"url": "https://en.wikipedia.org/wiki/HSL_and_HSV",
			"description": "Yet another polar transformation of sRGB, supported in, for example, Adobe CS software."
		},
		{
			"name": "Jzazbz",
			"id": "jzazbz",
			"url": "http://www.color.org/events/prague/MuhammadSafdar2017.pdf",
			"description": "A color space that improves on Lab, with much better perceptual uniformity, and also supports High Dynamic Range (HDR), or very bright colors brighter than a paper white. The transfer function is derived from Dolby PQ, which is defined in REC.2100 and used for HDR UHDTV."
		},
		{
			"name": "JzCzHz",
			"id": "jzczhz",
			"dependencies": ["jzazbz"],
			"url": "http://www.color.org/events/prague/MuhammadSafdar2017.pdf",
			"description": "Polar form of Jzazbz."
		},
		{
			"name": "ICtCp",
			"id": "ictcp",
			"url": "https://en.wikipedia.org/wiki/ICtCp",
			"description": "A color space that improves on Lab, with better perceptual uniformity and also supports High Dynamic Range (HDR), or very bright colors brighter than a paper white. The transfer function is Dolby PQ, which is defined in REC.2100 and used for HDR UHDTV."
		},
		{
			"name": "OKLab",
			"id": "oklab",
			"url": "https://bottosson.github.io/posts/oklab/",
			"description": "An improved version of CIE Lab, with improved hue linearity and orthogonality; derived from optimized LMS basis functions. Cube root transfer function."
		},
		{
			"name": "OKLCH",
			"id": "oklch",
			"url": "https://bottosson.github.io/posts/oklab/",
			"description": "The polar (Hue, Chroma) form of OK Lab"
		},
		{
			"name": "ACEScc",
			"id": "acescc",
			"url": "https://en.wikipedia.org/wiki/Academy_Color_Encoding_System",
			"description": "Academy Color Encoding System, using the wide gamut but physically realizable AP1 primaries and Logarithmic Encoding. Used for color grading."
		},
		{
			"name": "ACEScg",
			"id": "acescg",
			"url": "https://en.wikipedia.org/wiki/Academy_Color_Encoding_System",
			"description": "Scene-referred Academy Color Encoding System, using the wide gamut but physically realizable AP1 primaries and linear-light encoding. Used for physical rendering."
		},
		{
			"name": "Luv",
			"id": "luv",
			"url": "https://en.wikipedia.org/wiki/CIELUV",
			"description": "CIELUV is a color space developed in 1976 for perceptually uniform color representation, ideal for practical applications like digital displays. It's derived from the CIE 1931 XYZ space and includes L* for luminance, and u*, v* for chromaticity, capturing green–red and blue–yellow dimensions."
		},
		{
			"name": "LCHuv",
			"id": "lchuv",
			"dependencies": ["luv"],
			"url": "https://en.wikipedia.org/wiki/CIELUV",
			"description": "The polar (Hue, Chroma) form of CIE Luv."
		},
		{
			"name": "HSLuv",
			"id": "hsluv",
			"dependencies": ["lchuv"],
			"url": "https://www.hsluv.org/comparison/",
			"description": "The HSLuv color space is a perceptually uniform adaptation of the traditional HSL (Hue, Saturation, Lightness) color model. Engineered upon the foundations of the CIELUV color space, HSLuv ensures that colors that appear equally spaced in its representation also present consistent perceptual differences to the human observer. This results in a color space where changes in hue, saturation, or lightness produce predictable and coherent visual outcomes, addressing inconsistencies and unpredictable color shifts often found in standard HSL."
		},
		{
			"name": "HPLuv",
			"id": "hpluv",
			"dependencies": ["lchuv"],
			"url": "https://www.hsluv.org/comparison/",
			"description": "The HPLuv color space emphasizes perceptual uniformity specifically in its lightness component. HPLuv ensures that changes in lightness are consistently perceived by the human eye, regardless of the hue or saturation of the color. The resulting palette is a subset of sRGB and the colors are mainly pastel."
		},
		{
			"name": "CAM16-JMh",
			"id": "cam16-jmh",
			"url": "https://www.researchgate.net/publication/318152296_Comprehensive_color_solutions_CAM16_CAT16_and_CAM16-UCS#fullTextFileContent",
			"description": "An improved and simplified development from the earlier CIECAM02 Color Appearance Model, CAM16 provides three perceptual attributes: lightness J, colorfulness M and hue quadrature h. The default viewing conditions are: D65 white point, adapting luminance of 64 lux (4 cd/m²), average surround and less than full chromatic adaptation. This does mean that what other color models consider to be achromatic colors may have a non-zero colorfulness (M)."
		}
	],
	"optional": [
		{
			"name": "Interpolation",
			"id": "interpolation",
			"include": true,
			"url": "../docs/interpolation.html",
			"description": "Interpolate between colors, create ranges and scales."
		},
		{
			"name": "DeltaE CMC",
			"id": "deltaECMC",
			"path": "deltaE",
			"url": "https://en.wikipedia.org/wiki/Color_difference#CMC_l:c_(1984)",
			"description": "DeltaE CMC, a color difference metric of intermediate complexity and intermediate accuracy."
		},
		{
			"name": "DeltaE 2000",
			"id": "deltaE2000",
			"path": "deltaE",
			"url": "https://en.wikipedia.org/wiki/Color_difference#CIEDE2000",
			"description": "DeltaE 2000, the gold standard in deltaE as of present, but also the most complex. Especially good for small color differences."
		},
		{
			"name": "DeltaE Jz",
			"id": "deltaEJz",
			"path": "deltaE",
			"url": "http://www.color.org/events/prague/MuhammadSafdar2017.pdf",
			"description": "DeltaE based on the Jzazbz color space."
		},
		{
			"name": "DeltaE ITP",
			"id": "deltaEITP",
			"path": "deltaE",
			"url": "https://kb.portrait.com/help/ictcp-color-difference-metric",
			"description": "DeltaE based on the ICtCp color space. Improved on DeltaE2000 for WCG and HDR, while being computationally simpler."
		},
		{
			"name": "DeltaE OK",
			"id": "deltaEOK",
			"path": "deltaE",
			"description": "DeltaE based on the OKLab color space. Improved on DeltaE2000, while being computationally much simpler. Required for OKLCH gamut mapping."
		},
		{
			"name": "Chromatic adaptation",
			"id": "CATs",
			"description": "Color.js core only supports chromatic adaptation between D50 and D65 using the linear Bradford method. This module supports chromatic adaptation between arbitrary illuminants (with 9 presets) using Bradford, Van Kries, CAT02, or CAT16."
		},
		{
			"name": "Space accessors",
			"id": "space-accessors",
			"path": ".",
			"description": "To use the shorter `color.spaceId.coordName` syntax instead of `color.get()` and `color.set()`"
		},
		{
			"name": "Contrast",
			"id": "contrast",
			"path": ".",
			"description": "WCAG 2.1 contrast ratio"
		},
		{
			"name": "Chromaticity",
			"id": "chromaticity",
			"path": ".",
			"description": "color.uv and color.xy chromaticity"
		}
	]
}
